cask_args appdir: "/Applications"

# Taps
  tap "finestructure/Hummingbird"
  tap "facebook/fb"

##### Tools

  brew "git"
  brew "rg"
  brew "cocoapods"
  brew "yarn"
  brew "zsh"
  brew "zsh-completions"
  brew "zsh-syntax-highlighting"
  brew "watchman"

  # Node version manager
  brew "n"

  # Bash corrections
  brew "thefuck"

  # Create hardlnks https://github.com/selkhateeb/hardlink
  brew "hardlink-osx"

  # Executes a program periodically, showing output fullscreen
  brew "watch"

  # Rich process and resources epxlorer in the terminal
  brew "htop"

  # A cat(1) clone with syntax highlighting and Git integration.
  brew "bat"

  # Use instead of rm -rf to safely trash files
  brew "trash"

  # Debug with flipper on real iOS device
  brew "idb-companion"
  # Also run "pip3.8 install fb-idb --user"

##### Apps
  cask "alfred"
  cask "google-chrome"
  cask "firefox"
  cask "bettertouchtool"
  cask "visual-studio-code"
  cask "enpass"
  cask "bartender"
  cask "rocket"
  cask "betterzip"
  cask "qlcolorcode"
  cask "qlmarkdown"
  cask "qlstephen"
  cask "quicklook-json"
  cask "webpquicklook"
  cask "qlvideo"
  cask "scroll-reverser"
  cask "Hummingbird"
  cask "nightowl"
  cask "iterm2"
  cask "gitkraken"
  cask "raindropio"
  cask "signal"
  cask "whatsapp"
  cask "slack"
  cask "spotify"
  cask "1password"
  cask "1password-cli"
  cask "docker"
  cask "deluge"
  cask "macs-fan-control"
  cask "android-messages"
  cask "java"
  cask "android-studio"





# More setup needed, but basically
# brew "nodenv"
# eval "$(nodenv init -)"
# brew tap nodenv/nodenv
# brew install nodenv-package-json-engine
