cask_args appdir: "/Applications"

##### Tools
  brew "awscli"
  brew "bat" # A cat(1) clone with syntax highlighting and Git integration.
  brew "cloudflared"
  brew "coreutils" # Used to get timed commands in Warp
  # brew "cocoapods"
  brew "dust" # A more intuitive "du" command for analyzing disk space, built in rust
  brew "fzf" # Fuzzy finder (ctrl+r). Also requires running script manually
  brew "gh"
  brew "git"
  brew "gpg" # Used by GitKraken to sign commits
  # brew "idb-companion" # Debug with flipper on real iOS device (Also run "pip3.8 install fb-idb --user")
  brew "java"
  brew "oha"
  brew "rg"
  brew "trash" # Use instead of rm -rf to safely trash files
  brew "typos-cli" # Run `typos` cmd to find all typos in code
  brew "watch" # Executes a program periodically, showing output fullscreen
  brew "zsh-completions"
  brew "zsh-syntax-highlighting"
  brew "zsh"

##### Apps
  cask "1password-cli"
  cask "Arc"
  cask "adobe-acrobat-reader"
  cask "android-platform-tools"
  cask "android-messages"
  cask "android-studio"
  cask "bettertouchtool"
  cask "betterzip"
  cask "cron" # Calendar
  cask "discord"
  cask "deluge"
  # cask "docker"
  cask "figma"
  cask "firefox"
  # cask "flipper"
  cask "gitkraken"
  cask "google-chrome"
  cask "hiddenbar"
  cask "insomnia"
  cask "linear-linear"
  cask "microsoft-edge"
  cask "messenger"
  cask "MonitorControl" # Control external monitor brightness
  # cask "nightowl"
  # cask "postico"
  cask "qlmarkdown"
  cask "qlvideo"
  cask "quicklook-json"
  # cask "raindropio"
  # cask "rocket"
  cask "raycast"
  cask "scroll-reverser"
  cask "signal"
  cask "slack"
  cask "slite"
  cask "spotify"
  cask "visual-studio-code"
  cask "warp"
  cask "webpquicklook"
  cask "whatsapp"
